In [1]:
import numpy as np
import pandas as pd

Arquivo de Duplicadas

In [4]:
columns = ['user_id','age','gender','occupation','zip_code']
users = pd.read_table('duplicadas.txt', sep='|', header=None, names=columns)
users.head(10)

   user_id  age gender  occupation  zip_code
0        1   24      M  technician     85711
1        2   53      F       other     94043
2        3   23      M      writer     32067
3        1   24      M  technician     85711
4        4   24      M  technician     43537
5        5   33      F       other     15213
6        5   33      F       other     15213
7        1   24      M  technician     85711

In [5]:
# podemos encontrar duplicadas em relação a coluna zip_code
# lembrando que o duplicated retorna um bool onde a 1ª entrada é false
# e as duplicadas são true
users.zip_code.duplicated().head(20)

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
Name: zip_code, dtype: bool

In [6]:
users.zip_code.duplicated().sum()

3

In [9]:
# verificação da linha inteira = só retirar a coluna
users.duplicated().sum()

3

In [10]:
# mantendo a primeira linha
users.loc[users.duplicated(keep = 'first'),:]

   user_id  age gender  occupation  zip_code
3        1   24      M  technician     85711
6        5   33      F       other     15213
7        1   24      M  technician     85711

In [12]:
# mantendo a última linha
users.loc[users.duplicated(keep = 'last'), :]

   user_id  age gender  occupation  zip_code
0        1   24      M  technician     85711
3        1   24      M  technician     85711
5        5   33      F       other     15213

In [13]:
# todas as linhas duplicadas
users.loc[users.duplicated(keep=False), :]

   user_id  age gender  occupation  zip_code
0        1   24      M  technician     85711
3        1   24      M  technician     85711
5        5   33      F       other     15213
6        5   33      F       other     15213
7        1   24      M  technician     85711

In [14]:
# apagando as linhas duplicadas = inplace é false
users.drop_duplicates(keep=False).shape

(3, 5)

Arquivo de Users completo

In [16]:
# tomar cuidado com o id, se o dataset já contiver um index de BD que é incremental
# utiliar o id do arquivo, pois caso contrário ele n ira identificar como duplicadas, afinal o id vai mudar sempre
# utilizar o id do pandas só quando não houver id no arquivo
users = pd.read_table('users.txt', sep='|', header=None, names=columns, index_col='user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [17]:
# Conferindo o número de duplicados
users.zip_code.duplicated().sum()

148

In [18]:
# Verificando uma linha inteira duplicada
users.duplicated().sum()

7

In [20]:
# Mantém a primeira linha de cada duplicata
# First = primeira, Last = última, False = Todas
users.loc[users.duplicated(keep = 'first'), :]

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

Removendo as linhas do dataset

In [22]:
users.drop_duplicates(keep='first').shape

(936, 4)

Considerando colunas específicas

In [23]:
users.duplicated(subset=['age','zip_code']).sum()

16